In [79]:
import numpy as np
import pandas as pd

# Series

In [80]:
benimSozlugum = {"Musa" :23,"Atil":50, "Zeynep":40, "Mehmet":30 }

In [81]:
pd.Series(benimSozlugum)

Musa      23
Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [82]:
benimYaslarim = [23,50,40,30]
benimIsimlerim = ["Musa","Atıl","Zeynep","Mehmet"]

In [83]:
pd.Series(benimYaslarim)

0    23
1    50
2    40
3    30
dtype: int64

In [84]:
pd.Series(benimYaslarim,benimIsimlerim)

Musa      23
Atıl      50
Zeynep    40
Mehmet    30
dtype: int64

In [85]:
pd.Series(data=benimYaslarim,index = benimIsimlerim)

Musa      23
Atıl      50
Zeynep    40
Mehmet    30
dtype: int64

In [86]:
numpyDizisi = np.array([23,50,40,30])

In [87]:
numpyDizisi

array([23, 50, 40, 30])

In [88]:
pd.Series(numpyDizisi)

0    23
1    50
2    40
3    30
dtype: int32

In [89]:
pd.Series(data=numpyDizisi,index=benimIsimlerim)

Musa      23
Atıl      50
Zeynep    40
Mehmet    30
dtype: int32

# Series Özellikleri

In [90]:
pd.Series(["Musa","Atlas","Osman","Atıl"],[1,2,3,4])

1     Musa
2    Atlas
3    Osman
4     Atıl
dtype: object

In [91]:
yarismaSonucu1 = pd.Series([10,10,5,1],["Musa","Atıl","Atlas","Osman"])

In [92]:
yarismaSonucu1

Musa     10
Atıl     10
Atlas     5
Osman     1
dtype: int64

In [93]:
yarismaSonucu2 = pd.Series([15,20,10,8],["Musa","Atıl","Atlas","Osman"])

In [94]:
yarismaSonucu2

Musa     15
Atıl     20
Atlas    10
Osman     8
dtype: int64

In [95]:
yarismaSonucu2["Atlas"]

10

In [96]:
sonSonuc = yarismaSonucu1 + yarismaSonucu2

In [97]:
sonSonuc

Musa     25
Atıl     30
Atlas    15
Osman     9
dtype: int64

In [98]:
farkliSeries = pd.Series([20,30,40,50],["a","b","c","d"])

In [99]:
farkliSeries2 = pd.Series([10,5,3,1],["a","c","f","g"])

In [100]:
farkliSeries

a    20
b    30
c    40
d    50
dtype: int64

In [101]:
farkliSeries2

a    10
c     5
f     3
g     1
dtype: int64

In [102]:
farkliSeries+ farkliSeries2

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

# DataFrame Nedir?

In [103]:
data = np.random.randn(4,3)

In [104]:
data

array([[ 1.41585389, -0.04789001,  0.61744741],
       [ 0.71991289, -0.81873192, -1.33342446],
       [-0.30604992,  2.62741803, -1.42282132],
       [ 1.65345144, -0.17070226, -1.83669841]])

In [105]:
dataFrame = pd.DataFrame(data)

In [106]:
type(dataFrame[0])

pandas.core.series.Series

In [107]:
dataFrame

          0         1         2
0  1.415854 -0.047890  0.617447
1  0.719913 -0.818732 -1.333424
2 -0.306050  2.627418 -1.422821
3  1.653451 -0.170702 -1.836698

In [108]:
yeniDataFrame = pd.DataFrame(data,index=["Musa","Atil","Zeynep","Atlas"],columns=["Maas","Yas","Calisma Saati"])

In [109]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Musa    1.415854 -0.047890       0.617447
Atil    0.719913 -0.818732      -1.333424
Zeynep -0.306050  2.627418      -1.422821
Atlas   1.653451 -0.170702      -1.836698

In [110]:
yeniDataFrame["Yas"]

Musa     -0.047890
Atil     -0.818732
Zeynep    2.627418
Atlas    -0.170702
Name: Yas, dtype: float64

In [111]:
yeniDataFrame["Calisma Saati"]

Musa      0.617447
Atil     -1.333424
Zeynep   -1.422821
Atlas    -1.836698
Name: Calisma Saati, dtype: float64

In [112]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Musa    1.415854 -0.047890
Atil    0.719913 -0.818732
Zeynep -0.306050  2.627418
Atlas   1.653451 -0.170702

In [113]:
yeniDataFrame["Atil"]

KeyError: 'Atil'

In [114]:
yeniDataFrame.loc["Atil"]

Maas             0.719913
Yas             -0.818732
Calisma Saati   -1.333424
Name: Atil, dtype: float64

In [115]:
yeniDataFrame.loc["Zeynep"]

Maas            -0.306050
Yas              2.627418
Calisma Saati   -1.422821
Name: Zeynep, dtype: float64

In [116]:
yeniDataFrame.iloc[2]

Maas            -0.306050
Yas              2.627418
Calisma Saati   -1.422821
Name: Zeynep, dtype: float64

# Data Frame Indexler

In [117]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Musa    1.415854 -0.047890       0.617447
Atil    0.719913 -0.818732      -1.333424
Zeynep -0.306050  2.627418      -1.422821
Atlas   1.653451 -0.170702      -1.836698

In [118]:
yeniDataFrame["Emeklilik Yasi"] =  yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [119]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Musa    1.415854 -0.047890       0.617447       -0.095780
Atil    0.719913 -0.818732      -1.333424       -1.637464
Zeynep -0.306050  2.627418      -1.422821        5.254836
Atlas   1.653451 -0.170702      -1.836698       -0.341405

In [120]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1)

            Maas       Yas  Calisma Saati
Musa    1.415854 -0.047890       0.617447
Atil    0.719913 -0.818732      -1.333424
Zeynep -0.306050  2.627418      -1.422821
Atlas   1.653451 -0.170702      -1.836698

In [121]:
yeniDataFrame.drop("Atlas", axis=0)

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Musa    1.415854 -0.047890       0.617447       -0.095780
Atil    0.719913 -0.818732      -1.333424       -1.637464
Zeynep -0.306050  2.627418      -1.422821        5.254836

In [122]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Musa    1.415854 -0.047890       0.617447       -0.095780
Atil    0.719913 -0.818732      -1.333424       -1.637464
Zeynep -0.306050  2.627418      -1.422821        5.254836
Atlas   1.653451 -0.170702      -1.836698       -0.341405

In [123]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1, inplace=True)

In [124]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Musa    1.415854 -0.047890       0.617447
Atil    0.719913 -0.818732      -1.333424
Zeynep -0.306050  2.627418      -1.422821
Atlas   1.653451 -0.170702      -1.836698

In [125]:
yeniDataFrame.loc["Atil"]

Maas             0.719913
Yas             -0.818732
Calisma Saati   -1.333424
Name: Atil, dtype: float64

In [126]:
yeniDataFrame.loc["Atil"]["Maas"]

0.7199128865272818

In [127]:
yeniDataFrame.loc["Atlas","Yas"]

-0.1707022595455176

In [128]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Musa    1.415854 -0.047890       0.617447
Atil    0.719913 -0.818732      -1.333424
Zeynep -0.306050  2.627418      -1.422821
Atlas   1.653451 -0.170702      -1.836698

In [129]:
booleanFrame = yeniDataFrame<0

In [130]:
booleanFrame

         Maas    Yas  Calisma Saati
Musa    False   True          False
Atil    False   True           True
Zeynep   True  False           True
Atlas   False   True           True

In [131]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Musa    1.415854 -0.047890       0.617447
Atil    0.719913 -0.818732      -1.333424
Zeynep -0.306050  2.627418      -1.422821
Atlas   1.653451 -0.170702      -1.836698

In [132]:
yeniDataFrame[booleanFrame]

           Maas       Yas  Calisma Saati
Musa        NaN -0.047890            NaN
Atil        NaN -0.818732      -1.333424
Zeynep -0.30605       NaN      -1.422821
Atlas       NaN -0.170702      -1.836698

In [133]:
yeniDataFrame[yeniDataFrame<0]

           Maas       Yas  Calisma Saati
Musa        NaN -0.047890            NaN
Atil        NaN -0.818732      -1.333424
Zeynep -0.30605       NaN      -1.422821
Atlas       NaN -0.170702      -1.836698

In [134]:
yeniDataFrame["Yas"] > 0

Musa      False
Atil      False
Zeynep     True
Atlas     False
Name: Yas, dtype: bool

In [135]:
yeniDataFrame[yeniDataFrame["Yas"] > 0]

           Maas       Yas  Calisma Saati
Zeynep -0.30605  2.627418      -1.422821

In [136]:
yeniDataFrame[yeniDataFrame["Calisma Saati"] > 0]

          Maas      Yas  Calisma Saati
Musa  1.415854 -0.04789       0.617447

# Indeks Değiştirme

In [137]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Musa    1.415854 -0.047890       0.617447
Atil    0.719913 -0.818732      -1.333424
Zeynep -0.306050  2.627418      -1.422821
Atlas   1.653451 -0.170702      -1.836698

In [138]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0    Musa  1.415854 -0.047890       0.617447
1    Atil  0.719913 -0.818732      -1.333424
2  Zeynep -0.306050  2.627418      -1.422821
3   Atlas  1.653451 -0.170702      -1.836698

In [139]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Musa    1.415854 -0.047890       0.617447
Atil    0.719913 -0.818732      -1.333424
Zeynep -0.306050  2.627418      -1.422821
Atlas   1.653451 -0.170702      -1.836698

In [140]:
yeniIndeksListesi = ["Mus","Ati","Zey","Atl"]

In [141]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi

In [142]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Musa    1.415854 -0.047890       0.617447         Mus
Atil    0.719913 -0.818732      -1.333424         Ati
Zeynep -0.306050  2.627418      -1.422821         Zey
Atlas   1.653451 -0.170702      -1.836698         Atl

In [143]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati
Yeni Indeks
Mus          1.415854 -0.047890       0.617447
Ati          0.719913 -0.818732      -1.333424
Zey         -0.306050  2.627418      -1.422821
Atl          1.653451 -0.170702      -1.836698

In [144]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Musa    1.415854 -0.047890       0.617447         Mus
Atil    0.719913 -0.818732      -1.333424         Ati
Zeynep -0.306050  2.627418      -1.422821         Zey
Atlas   1.653451 -0.170702      -1.836698         Atl

In [145]:
yeniDataFrame.set_index("Yeni Indeks", inplace=True)

In [146]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni Indeks
Mus          1.415854 -0.047890       0.617447
Ati          0.719913 -0.818732      -1.333424
Zey         -0.306050  2.627418      -1.422821
Atl          1.653451 -0.170702      -1.836698

In [147]:
yeniDataFrame.loc["Ati"]

Maas             0.719913
Yas             -0.818732
Calisma Saati   -1.333424
Name: Ati, dtype: float64

# Multi Indeks

In [148]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [149]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [150]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [151]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [152]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [153]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [154]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [155]:
benimCizgiFilmListem

[[40, 'A'], [10, 'B'], [30, 'C'], [9, 'D'], [10, 'E'], [11, 'F']]

In [156]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [158]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [159]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [160]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [161]:
cizgiFilmDataFrame.loc["South Park"]

        Yas Meslek
Cartman   9      D
Kenny    10      E
Kyle     11      F

In [162]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [163]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [164]:
cizgiFilmDataFrame.index.names = ["Film Adı","İsim"]

In [165]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

# Eksik Veriler

In [166]:
sozlukVerisi = {"Istanbul":[30,29,np.nan], "Ankara": [20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [167]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [168]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [169]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [170]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [171]:
yeniVeri = {"Istanbul":[30,29,np.nan], "Ankara": [20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [172]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [173]:
yeniDataFrame.dropna(axis=1, thresh = 2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [174]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

# Gruplandırmak

# groupby

In [178]:
maasSozlugu = {"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
              "Çalisan Ismi" : ["Ahmet","Mehmet","Musa","Atıl","Burak","Zeynep"],
              "Maas":[100,150,200,300,400,500]
              }

In [179]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [180]:
maasDataFrame

   Departman Çalisan Ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Musa   200
3  Pazarlama         Atıl   300
4      Hukuk        Burak   400
5      Hukuk       Zeynep   500

In [182]:
grupObjesi = maasDataFrame.groupby("Departman")

In [185]:
grupObjesi.count()

           Çalisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [186]:
grupObjesi.mean()

            Maas
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [187]:
grupObjesi.min()

          Çalisan Ismi  Maas
Departman
Hukuk            Burak   400
Pazarlama         Atıl   200
Yazılım          Ahmet   100

In [188]:
grupObjesi.max()

          Çalisan Ismi  Maas
Departman
Hukuk           Zeynep   500
Pazarlama         Musa   300
Yazılım         Mehmet   150

In [189]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

# concat

In [200]:
sozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
          "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
          "Kalori":[100,200,300,400]}

In [204]:
dataFrame1 = pd.DataFrame(sozluk1,index=[0,1,2,3])

In [202]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [205]:
sozluk2 = {"Isim" : ["Osman","Levent","Atlas","Fatma"],
          "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
          "Kalori":[200,100,50,300]}

In [206]:
dataFrame2 = pd.DataFrame(sozluk2,index=[4,5,6,7])

In [208]:
sozluk3 = {"Isim" : ["Yeter","Mahmut","Duygu","Nur"],
          "Spor":["Koşu","Yüzme","Badminton","Tenis"],
          "Kalori":[300,400,500,250]}

In [209]:
dataFrame3 = pd.DataFrame(sozluk3,index=[8,9,10,11])

In [210]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [211]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [212]:
dataFrame3

      Isim       Spor  Kalori
8    Yeter       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

# concatenation

In [216]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8    Yeter       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

# merge

In [218]:
mergeSozluk1= {"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
  "Spor":["Koşu","Yüzme","Koşu","Basketbol"]}

mergeSozluk2= {"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
  "Kalori":[100,200,250,150]}

In [219]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [220]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [221]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     250
3    Atıl     150

In [222]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     250
3    Atıl  Basketbol     150

In [232]:
maasSozluk = {"Isim" :[ "Atıl","Zeynep","Mehmet","Ahmet"],
             "Departman":["Yazılım","Satış","Pazarlama","Yazılım"],
             "Maas":[200,300,400,500]}

In [233]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [234]:
maasDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [235]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [236]:
maasDataFrame["Departman"].nunique()

3

In [237]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [241]:
def bruttenNete(maas):
    return maas * 0.66

In [242]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [243]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [251]:
yeniBirVeri = {"Karakter Sınıfı":["South Park","South Park","Simpson","Simpson","Simpson"],
              "Karakter Ismi" : ["Cartman","Kenny","Homer","Bart","Bart"],
              "Karakter Yas" : [9,10,50,20,10]}

In [252]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [253]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [255]:
karakterDF.pivot_table(values="Karakter Yas",index = ["Karakter Sınıfı","Karakter Ismi"],aggfunc=np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

# Excelle Çalışmak

In [257]:
dataFrame = pd.read_excel("maas.xlsx")

In [258]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Musa   200  23.0    Yazılım
1       Atıl   100  40.0    Yazılım
2     Zeynep   150  50.0      Satış
3     Mehmet   200  30.0        NaN
4      Ahmet    50  10.0  Pazarlama
5      Atlas   150   NaN     Finans
6      Fatma   200  25.0      Hukuk

In [260]:
doluDegerlerDataFrame = dataFrame.dropna()

In [261]:
doluDegerlerDataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Musa   200  23.0    Yazılım
1       Atıl   100  40.0    Yazılım
2     Zeynep   150  50.0      Satış
4      Ahmet    50  10.0  Pazarlama
6      Fatma   200  25.0      Hukuk

In [262]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Musa   200  23.0    Yazılım
1       Atıl   100  40.0    Yazılım
2     Zeynep   150  50.0      Satış
3     Mehmet   200  30.0        NaN
4      Ahmet    50  10.0  Pazarlama
5      Atlas   150   NaN     Finans
6      Fatma   200  25.0      Hukuk

In [264]:
doluDegerlerDataFrame.to_excel("yenimaas.xlsx")

In [265]:
## read_csv
## to_csv